RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer4_oco.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_timer4_oco.c
 **
 ** A detailed description is available at
 ** @link Timer4OcoGroup Timer4OCO description @endlink
 **
 **   - 2018-11-02 CDT First version for Device Driver Library of Timer4OCO.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_timer4_oco.h"
#include "hc32f460_utility.h"

#if (DDL_TIMER4_OCO_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup Timer4OcoGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter validity check for Timer4 unit  */
#define IS_VALID_TIMER4(__TMRx__)                                              \
(   (M4_TMR41 == (__TMRx__))                ||                                 \
    (M4_TMR42 == (__TMRx__))                ||                                 \
    (M4_TMR43 == (__TMRx__)))

/*!< Parameter validity check for oco channel  */
#define IS_VALID_OCO_CH(x)                                                     \
(   (Timer4OcoOuh == (x))                   ||                                 \
    (Timer4OcoOul == (x))                   ||                                 \
    (Timer4OcoOvh == (x))                   ||                                 \
    (Timer4OcoOvl == (x))                   ||                                 \
    (Timer4OcoOwh == (x))                   ||                                 \
    (Timer4OcoOwl == (x)))

/*!< Parameter validity check for oco low channel  */
#define IS_VALID_OCO_LOW_CH(x)                                                 \
(   (Timer4OcoOul == (x))                   ||                                 \
    (Timer4OcoOvl == (x))                   ||                                 \
    (Timer4OcoOwl == (x)))

/*!< Parameter validity check for even high channel  */
#define IS_VALID_OCO_HIGH_CH(x)                                                \
(   (Timer4OcoOuh == (x))                   ||                                 \
    (Timer4OcoOvh == (x))                   ||                                 \
    (Timer4OcoOwh == (x)))

/*!< Parameter validity check for occr buffer mode  */
#define IS_VALID_OCCR_BUF_MODE(x)                                              \
(   (OccrBufDisable == (x))                 ||                                 \
    (OccrBufTrsfByCntZero == (x))           ||                                 \
    (OccrBufTrsfByCntPeak == (x))           ||                                 \
    (OccrBufTrsfByCntZeroOrCntPeak == (x))  ||                                 \
    (OccrBufTrsfByCntZeroZicZero == (x))    ||                                 \
    (OccrBufTrsfByCntPeakPicZero == (x))    ||                                 \
    (OccrBufTrsfByCntZeroZicZeroOrCntPeakPicZero == (x)))

/*!< Parameter validity check for ocmr buffer mode  */
#define IS_VALID_OCMR_BUF_MODE(x)                                              \
(   (OcmrBufDisable == (x))                 ||                                 \
    (OcmrBufTrsfByCntZero == (x))           ||                                 \
    (OcmrBufTrsfByCntPeak == (x))           ||                                 \
    (OcmrBufTrsfByCntZeroOrCntPeak == (x))  ||                                 \
    (OcmrBufTrsfByCntZeroZicZero == (x))    ||                                 \
    (OcmrBufTrsfByCntPeakPicZero == (x))    ||                                 \
    (OcmrBufTrsfByCntZeroZicZeroOrCntPeakPicZero == (x)))

/*!< Parameter validity check for output level type  */
#define IS_VALID_OP_PORT_LEVEL(x)                                              \
(   (OcPortLevelLow == (x))                 ||                                 \
    (OcPortLevelHigh == (x)))

/*!< Parameter validity check for oco OP state  */
#define IS_VALID_OP_STATE(x)                                                   \
(   (OcoOpOutputLow == (x))                 ||                                 \
    (OcoOpOutputHigh == (x))                ||                                 \
    (OcoOpOutputHold == (x))                ||                                 \
    (OcoOpOutputReverse == (x)))

/*!< Parameter validity check for oco OCF state  */
#define IS_VALID_OCF_STATE(x)                                                  \
(   (OcoOcfSet == (x))                      ||                                 \
    (OcoOcfHold == (x)))

/*!< Get the specified register address of the specified Timer4 unit */
#define TMR4_OCCRx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->OCCRUH + ((uint32_t)(__CH__))*4ul)
#define TMR4_OCMRx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->OCMRHUH + ((uint32_t)(__CH__))*4ul)
#define TMR4_OCERx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->OCERU + (((uint32_t)(__CH__))/2ul)*4ul)
#define TMR4_OCSRx(__TMR4x__, __CH__)       ((uint32_t)&(__TMR4x__)->OCSRU + (((uint32_t)(__CH__))/2ul)*4ul)

